var a;

a = Math.round(Math.random() * 15);

switch(a){
    case 0:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "0");
    case 1:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "1");
    case 2:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "2");
    case 3:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "3");
    case 4:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "4");
    case 5:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "5");
    case 6:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "6");
    case 7:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "7");
    case 8:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "8");
    case 9:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "9");
    case 10:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "10");
    case 11:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "11");
    case 12:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "12");
    case 13:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "13");
    case 14:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "14");
    case 15:
        alert("Урок 2\n" + "Задание 4: \n" + "a = " + a + "\n" + "15");
        break;
    default:
        alert("Урок 2\n" + "Задание 4: \n" + "Не порядок");
}

